---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeStructuralDepth
source: html/3bc901fb-7137-9258-fa47-a2deea91a96b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeStructuralDepth Property

"Structural Depth": Structural Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRuntypeStructuralDepth { get; }
```